package codingPractice;

public class BinaryJumps {

    public static void main (String[] args) {

        String game = "10101111100010" +
                "01001110100101001010" +
                "10000011111110011100" +
                "00010111101010010011" +
                "00101110111001101101" +
                "00000001011101101111" +
                "01111100000110101010" +
                "10101011000000011100" +
                "00001001001001101111" +
                "01100001010001001100" +
                "11100100010010110010" +
                "00110000001111100111" +
                "10100100001010101011" +
                "00100111111010101010" +
                "10000011101011110110" +
                "00101111001110001110" +
                "01111011100011110000" +
                "10010111100000110111" +
                "00001110001011110100" +
                "10001010011010111110" +
                "01010000000011000010" +
                "01000100101111100100" +
                "01111100001001100110" +
                "00111100101100100101" +
                "00001111101001001001" +
                "10100011001011101001" +
                "01111011000000100001" +
                "01011000110010111001" +
                "11011100110011000101";

        int result = 1; // 이동 수는 최소 1

        char lastTile = game.charAt(game.length() - 1); // 마지막 타일 가져오기

        int current = result; // 현재 이동수
        for(int i=0; i<game.length(); i++) {
            if (game.charAt(i) != lastTile) { // 현재 타일이 점프해야할 타일이라면
                current++;                    // 현재 최소 점프수 증가
            } else {                          // 현재 타일이 이동할 수 있는 타일이라면 현재 최소 점프수를 확인
                if (current > result) {       // 현재 최소 점프수가 최종 최소 점프수보다 크다면
                    result = current;         // 최종 최소 점프수 변경
                }
                current = 1;                  // 현재 최소 점프수 초기화
            }
        }

        System.out.println(result);
    }

}
